package quiz;

public class A01_printQuiz {

	public static void main(String[] args) {
		// sysout 적은 뒤 Ctrl + Space : 자동완성
		System.out.println("=====================");
		System.out.println("        /)/)");
		System.out.println("       (  ..)");
		System.out.println("       (  >♡");
		System.out.println("  Have a Good Time.");
		System.out.println("=====================");
		
		// 비어있는 sysout은 한줄 공백을 생성한다
		System.out.println();
		
		System.out.println("            #### 회비 정보 ####");
		System.out.println("============================================");
		System.out.println("이름\t나이\t전화번호\t\t회비");
		System.out.println("============================================");
		System.out.println("홍길동\t\"15\"\t010-123-1234\t$20,000");
		System.out.println("임꺽정\t\"20\"\t010-234-2345\t$30,000");
		System.out.println("김말이\t\"28\"\t010-345-3456\t$50,000");
		System.out.println("--------------------------------------------");
		System.out.println("총합계\t\t\t\t$100,000");
		System.out.println("============================================");
	}
	
		// Ctrl + /로 범위 주석 처리
//		System.out.println("\r\n"
//				+ "                                           /\r\n"
//				+ "                        _,.------....___,.' ',.-.\r\n"
//				+ "                     ,-'          _,.--\"        |\r\n"
//				+ "                   ,'         _.-'              .\r\n"
//				+ "                  /   ,     ,'                   `\r\n"
//				+ "                 .   /     /                     ``.\r\n"
//				+ "                 |  |     .                       \\.\\\r\n"
//				+ "       ____      |___._.  |       __               \\ `.\r\n"
//				+ "     .'    `---\"\"       ``\"-.--\"'`  \\               .  \\\r\n"
//				+ "    .  ,            __               `              |   .\r\n"
//				+ "    `,'         ,-\"'  .               \\             |    L\r\n"
//				+ "   ,'          '    _.'                -._          /    |\r\n"
//				+ "  ,`-.    ,\".   `--'                      >.      ,'     |\r\n"
//				+ " . .'\\'   `-'       __    ,  ,-.         /  `.__.-      ,'\r\n"
//				+ " ||:, .           ,'  ;  /  / \\ `        `.    .      .'/\r\n"
//				+ " j|:D  \\          `--'  ' ,'_  . .         `.__, \\   , /\r\n"
//				+ "/ L:_  |                 .  \"' :_;                `.'.'\r\n"
//				+ ".    \"\"'                  \"\"\"\"\"'                    V\r\n"
//				+ " `.                                 .    `.   _,..  `\r\n"
//				+ "   `,_   .    .                _,-'/    .. `,'   __  `\r\n"
//				+ "    ) \\`._        ___....----\"'  ,'   .'  \\ |   '  \\  .\r\n"
//				+ "   /   `. \"`-.--\"'         _,' ,'     `---' |    `./  |\r\n"
//				+ "  .   _  `\"\"'--.._____..--\"   ,             '         |\r\n"
//				+ "  | .\" `. `-.                /-.           /          ,\r\n"
//				+ "  | `._.'    `,_            ;  /         ,'          .\r\n"
//				+ " .'          /| `-.        . ,'         ,           ,\r\n"
//				+ " '-.__ __ _,','    '`-..___;-...__   ,.'\\ ____.___.'\r\n"
//				+ " `\"^--'..'   '-`-^-'\"--    `-^-'`.''\"\"\"\"\"`.,^.`.--' mh");
//	}
	
}


